#.................ini.............................
global city

global client_id
global client_secret
global access_token
global refresh_token
global cwb_auth_key 
#.................ini value.............................

city = {'臺北市': '0', '台北市': '0', '新北市': '1', '桃園市': '2', '臺中市': '3', '台中市': '3','臺南市': '4', '台南市': '4', '高雄市': '5', '基隆市': '6', '新竹縣': '7', '新竹市': '8', '苗栗縣': '9', '彰化縣': '10', '南投縣': '11', '雲林縣': '12', '嘉義縣': '13', '嘉義市': '14', '屏東縣': '15', '宜蘭縣': '16', '花蓮縣': '17', '臺東縣': '18','台東縣': '18', '澎湖縣': '19', '金門縣': '20', '連江縣': '21'}

cwb_auth_key = ""

# imgur
client_id = ""
client_secret = ""
access_token = ""
refresh_token = ""